---
kind: property
id: P:Autodesk.Revit.DB.Arc.YDirection
zh: 弧、圆弧
source: html/eae63197-de07-27de-a7ef-1e61ea49b747.htm
---
# Autodesk.Revit.DB.Arc.YDirection Property

**中文**: 弧、圆弧

Returns the Y direction.

## Syntax (C#)
```csharp
public XYZ YDirection { get; }
```